app/controllers/categories_controller.rb

  def index
    @category = Category.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def destroy
    #delete the category
    @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 3]]