app/controllers/outstanding_transactions_controller.rb

SELECT "outstanding_transactions".* FROM "outstanding_transactions" WHERE "outstanding_transactions"."kind" = ? AND "outstanding_transactions"."settled" = 'f'  [["kind", "expense"]]
---
  def index
    @debts = OutstandingTransaction.where("kind = ? AND settled = ?", "expense", false)

INSERT INTO "outstanding_transactions" ("amount", "description", "other_party", "kind", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @outstanding_transaction = OutstandingTransaction.new(outstanding_transaction_params)
    respond_to do |format|
      if @outstanding_transaction.save

UPDATE "outstanding_transactions" SET "other_party" = ?, "updated_at" = ? WHERE "outstanding_transactions"."id" = ?  [["other_party", "cdddd"], ["updated_at", "2015-06-22 17:39:10.289913"], ["id", 13]]
---
  def update
    respond_to do |format|
      if @outstanding_transaction.update(outstanding_transaction_params)

DELETE FROM "outstanding_transactions" WHERE "outstanding_transactions"."id" = ?  [["id", 13]]
---
  def destroy
    @outstanding_transaction.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Debt Settlement"]]
INSERT INTO "transactions" ("amount", "description", "kind", "date", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "outstanding_transactions" SET "settled" = ?, "updated_at" = ? WHERE "outstanding_transactions"."id" = ?  [["settled", "t"], ["updated_at", "2015-06-20 07:22:45.427046"], ["id", 3]]
---
  def settle_outstanding
    @transaction = Transaction.new(:amount => @outstanding_transaction.amount, :description => @outstanding_transaction.description, :kind => @outstanding_transaction.kind, :date => Date.today)
    if @outstanding_transaction.kind == "expense"
      @transaction.category = Category.find_by_name("Debt Settlement")
    else
      @transaction.category = Category.find_by_name("Credit Settlement")
    end
    @outstanding_transaction.settled = true
    respond_to do |format|
      if @transaction.save && @outstanding_transaction.save

SELECT  "outstanding_transactions".* FROM "outstanding_transactions" WHERE "outstanding_transactions"."id" = ? LIMIT 1  [["id", 13]]
---
  def set_outstanding_transaction
    @outstanding_transaction = OutstandingTransaction.find(params[:id])