app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("amount", "category_id", "description", "kind", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["amount", 87000.0], ["category_id", 2], ["description", "MyUS yearly Fees"], ["kind", "expense"], ["created_at", "2015-06-20 00:34:02.559420"], ["updated_at", "2015-06-20 00:34:02.559420"]]
---
  def create
    respond_to do |format|
      if @transaction.save

UPDATE "transactions" SET "amount" = ?, "updated_at" = ? WHERE "transactions"."id" = ?  [["amount", 1670.0], ["updated_at", "2015-06-20 02:07:53.446202"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @transaction.update(transaction_params)

DELETE FROM "transactions" WHERE "transactions"."id" = ?  [["id", 9]]
---
  def destroy
    @transaction.destroy

SELECT  "transactions".* FROM "transactions"  ORDER BY date DESC, id DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "transactions"
---
  def set_transactions
    @transactions = Transaction.paginate(:page => params[:page]).order("date DESC").order("id DESC")