app/views/transactions/_form.html.erb

SELECT "categories".* FROM "categories"  ORDER BY "categories"."name" ASC
---
			<label>Category</label>
			<%= f.collection_select :category_id, Category.order(:name),:id,:name, {:prompt => "Category"}, {:class => "form-control", :data => {:required => "true"}} %>